#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
aws_vpc.example: Refreshing state... [id=vpc-0e8406e4a9d7db581]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_vpc.example must be replaced
-/+ resource "aws_vpc" "example" {
      ~ arn                                  = "arn:aws:ec2:ap-northeast-2:318374019075:vpc/vpc-0e8406e4a9d7db581" -> (known after apply)
      - assign_generated_ipv6_cidr_block     = false -> null
      ~ cidr_block                           = "10.1.0.0/16" -> "10.2.0.0/16" # forces replacement
      ~ default_network_acl_id               = "acl-0833ecc8600d6dca5" -> (known after apply)
      ~ default_route_table_id               = "rtb-09fd930e80484e7f6" -> (known after apply)
      ~ default_security_group_id            = "sg-0ed03b68862666142" -> (known after apply)
      ~ dhcp_options_id                      = "dopt-0c93c34b633b49aad" -> (known after apply)
      ~ enable_dns_hostnames                 = false -> (known after apply)
      ~ enable_network_address_usage_metrics = false -> (known after apply)
      ~ id                                   = "vpc-0e8406e4a9d7db581" -> (known after apply)
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      - ipv6_netmask_length                  = 0 -> null
      ~ main_route_table_id                  = "rtb-09fd930e80484e7f6" -> (known after apply)
      ~ owner_id                             = "318374019075" -> (known after apply)
        tags                                 = {
            "Name" = "earth-dev"
        }
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @jonghak-lee, Action: `pull_request`, Workflow: `Terraform plan and apply`*